code-editing-from-phone.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Code editing from phone</title>
<meta name="generator" content="Org mode">
<meta name="description" content="My setup to edit code and commit to repository from anywhere in the world."
>
<meta name="keywords" content="vscode, git, repo, linuxserver, docker">
<link rel='stylesheet' href='./css/code.css' />
<link rel='stylesheet' href='./css/simple.css' />
<link rel='shortcut icon' href='./img/favicon.ico' type='image/x-icon' />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/fork-awesome@1.2.0/css/fork-awesome.min.css' integrity='sha256-XoaMnoYC5TH6/+ihMEnospgm0J1PM/nioxbOUdnM8HY=' crossorigin='anonymous'>
</head>
<body>
<header id="top" class="status">
<a href="./index.html">shrirambo</a>.<a href="https://github.com/shrirambo">github</a>.<a href="">io</a>/<a href="./index.html">home</a>/<a href="./index.html">blog</a>
</header>
<main id="content">
<h1 class="title">Code editing from phone</h1>
<hr>
<p>
Mobile phones are not really ideal devices to edit code and do serious programming. Although I still wanted to have a solution to let me edit scripts, push to git, save on home server or just run modified scripts. 
</p>

<p>
There might be some good editors that works with webdav or sftp server. But I couldn't find any good ones for ios. My solution, run a code server and access it from anywhere with VPN. <a href="http://linuxserver.io">linuxserver.io</a> has a nice docker image for this. It runs a selfhosted version of <a href="https://vscode.dev">https://vscode.dev</a>. 
</p>

<p>
My main usecase is to write blogs/static web pages like this one in org mode. Which will be published on github pages. I will try to write my thoughts, informative notes as blogs, or any random things I wish to. 
</p>

<p>
Let's see how long before I abandon this project. 👻
</p>
</main>
<footer id="postamble" class="status">
<hr>
<section>
<script src="https://giscus.app/client.js" 
  data-repo="ShriRambo/giscus-comments"
  data-repo-id="R_kgDOG1mtrQ"
  data-category="Announcements" 
  data-category-id="DIC_kwDOG1mtrc4CBJNW" 
  data-mapping="title" 
  data-reactions-enabled="1" 
  data-emit-metadata="0" 
  data-input-position="top" 
  data-theme="dark" 
  data-lang="en" 
  crossorigin="anonymous" 
  async> </script>
</section>
<hr>
<section>
  <p style="text-align:center">
Made with ❤️ and Emacs (Org-mode)
</p>
<div align=center>
  <a href="#" class='link-icon'>
    <i class="fa fa-home fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://www.instagram.com/shrirambo/" class='link-icon'>
    <i class="fa fa-instagram fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://github.com/shrirambo" class='link-icon'>
    <i class="fa fa-github fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://www.linkedin.com/in/shriram-ashirgade/' class='link-icon'>
    <i class="fa fa-linkedin-square fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://social.vivaldi.net/@shrirambo'>
    <i class="fa fa-mastodon fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://github.com/ShriRambo/sturdy-octo-winner/tree/master/content' class='link-icon'>
    <i class="fa fa-code  fa-lg" aria-hidden="true"></i>
  </a>
  <a href='#content' class='link-icon'>
    <i class="fa fa-hand-o-up  fa-lg" aria-hidden="true"></i>
  </a>
</div>
</div>
</footer>
</body>
</html>
